DataProcessors/СкопироватьФайл_AUTOCATALOG_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>СкопироватьФайл_AUTOCATALOG_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники</Name>
			<Comment>Скопировать файл AUTOCATALOG.XML с сайта AVITO.RU и загрузить справочники</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПределСтрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/Модели_Авито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модели_Авито</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марка_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Комплектации_Авито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Комплектации_Авито</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Модификации_Авито</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Генерации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СМ_ТипыКузововАвито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СМ_ТипыКузововАвито</Name>
			<Comment>Типы кузовов автомобилей</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерческий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Модификации_Авито.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модификации_Авито</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Модели_Авито</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Генерации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коммерция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/СкопироватьФайл_AUTOCATALOG_XML_сСайта_AVITO_RU_ИЗагрузитьСправочники/Ext/ObjectModule.bsl
Процедура АвитоЗагрузкаСправочниковМодуль() Экспорт
	
	ВнутреннийАдресСервера = "https://autoload.avito.ru/format/Autocatalog.xml";
	
  	ИмяФайлаНазначение = ПолучитьИмяВременногоФайла("xml");
	ФайлНаДиске = Новый Файл(ИмяФайлаНазначение);
	
	Для Счетчик = 1 По 10 Цикл
		КопироватьФайл(ВнутреннийАдресСервера,ИмяФайлаНазначение);
  		Если ФайлНаДиске.Существует() Тогда
 			Прервать;
		КонецЕсли;
		Пауза30секунд = 30;
		КонДата = ТекущаяДата() + Пауза30секунд;
  		Пока ТекущаяДата() < КонДата Цикл
      		//...  
  		КонецЦикла;
 	КонецЦикла; 
	
	Если НЕ ФайлНаДиске.Существует() Тогда
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("ОШИБКА! Информация с сайта не скопирована в файл: <"+СокрЛП(ИмяФайлаНазначение)+">",СтатусСообщения.ОченьВажное);
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
  		Возврат;
	Иначе
		#Если НаКлиенте Тогда
			Попытка
		       Сообщить("Информация с сайта скопирована в файл: <"+СокрЛП(ФайлНаДиске.ПолноеИмя)+">");
 			Исключение
				//				
			КонецПопытки;		 
 		#КонецЕсли
	КонецЕсли;  
	
	ёё = 0;
	
	МаркаАвито         = Справочники.Марка_Авито.ПустаяСсылка();
	МодельАвито        = Справочники.Модели_Авито.ПустаяСсылка();
	ГенерацияАвито     = Справочники.Генерации_Авито.ПустаяСсылка();
	МодификацияАвито   = Справочники.Модели_Авито.ПустаяСсылка();
	КомплектацияАвито  = Справочники.Комплектации_Авито.ПустаяСсылка();
	ТипКузоваАвито     = Справочники.СМ_ТипыКузововАвито.ПустаяСсылка();
	АртикулМарки       = "";
	АртикулМодели      = "";
	АртикулГенерации   = "";
	АртикулМодификации = "";
	АртикулТипаКузова  = "";
 	
	ЧтениеXML = Новый ЧтениеXML();
	
	ЧтениеXML.ОткрытьФайл(ИмяФайлаНазначение);
	
 	Пока ЧтениеXML.Прочитать() Цикл
 		
 		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ТекущееИмя = ЧтениеXML.Имя;
			
			Если ТекущееИмя = "Make" Тогда
				АртикулМарки = ЧтениеXML.ПолучитьАтрибут(0);
 			ИначеЕсли ТекущееИмя = "Model" Тогда
				АртикулМодели = ЧтениеXML.ПолучитьАтрибут(0);
			ИначеЕсли ТекущееИмя = "Generation" Тогда	
				АртикулГенерации = ЧтениеXML.ПолучитьАтрибут(0);
			ИначеЕсли ТекущееИмя = "Modification" Тогда	
				АртикулМодификации = ЧтениеXML.ПолучитьАтрибут(0);
			ИначеЕсли ТекущееИмя = "BodyType" Тогда		
				ТипКузоваАвито = ЧтениеXML.ПолучитьАтрибут(0);
 			КонецЕсли; 
			
			Если ТекущееИмя = "Complectations" Тогда
				Пока ЧтениеXML.Прочитать() Цикл
					Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
						Если ЧтениеXML.Имя = "Complectations"  Тогда
							Прервать;
						КонецЕсли;
						Если ЧтениеXML.Имя = "Complectation"  Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;
 					НазваниеКомплектации = ЧтениеXML.ПолучитьАтрибут(1);
					АртикулКомплектации = ЧтениеXML.ПолучитьАтрибут(0);
					//Бондаренко++ 20240627
					Если СокрЛП(НазваниеКомплектации)<> "" Тогда
						Если СокрЛП(АртикулКомплектации)<> "" Тогда
					//Бондаренко-- 20240627			
							КомплектацияАвито = НайтиИлиСоздатьКомплектацию(НазваниеКомплектации,АртикулКомплектации,МодификацияАвито,ГенерацияАвито);	
					//Бондаренко++ 20240627								
					    КонецЕсли;
					КонецЕсли;
  	 				//Бондаренко-- 20240627	 
 				КонецЦикла	
	 		КонецЕсли;
   
		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			
			ТекущееЗначение = ЧтениеXML.Значение;
			
			Если ТекущееИмя = "Make" Тогда
 				МаркаАвито = НайтиИлиСоздатьМарку(ТекущееЗначение,АртикулМарки);
 			ИначеЕсли ТекущееИмя = "Model" Тогда
  				МодельАвито = НайтиИлиСоздатьМодель(ТекущееЗначение,АртикулМодели,МаркаАвито);
 			ИначеЕсли ТекущееИмя = "Generation" Тогда
 				ГенерацияАвито = НайтиИлиСоздатьГенерацию(ТекущееЗначение,АртикулГенерации,МодельАвито);
  			ИначеЕсли ТекущееИмя = "Modification" Тогда
 				МодификацияАвито = НайтиИлиСоздатьМодификацию(ТекущееЗначение,АртикулМодификации,МодельАвито,ГенерацияАвито);
			ИначеЕсли ТекущееИмя = "BodyType" Тогда
 				ТипКузоваАвито = НайтиИлиСоздатьТипКузова(ТекущееЗначение,АртикулТипаКузова);
  			КонецЕсли; 
			
   		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();	

КонецПроцедуры

Функция НайтиИлиСоздатьМарку(Наименование,Артикул) Экспорт
	
	НовМарка = Справочники.Марка_Авито.ПустаяСсылка();
	
	//Бондаренко++ 20240330
	Если СокрЛП(Артикул) <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Марка_Авито.Ссылка,
		|	Марка_Авито.Наименование,
		|	Марка_Авито.Артикул
		|ИЗ
		|	Справочник.Марка_Авито КАК Марка_Авито
		|ГДЕ
 		|	Марка_Авито.Артикул = &Артикул";
		
 		Запрос.УстановитьПараметр("Артикул", Артикул);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовМарка = ВыборкаДетальныеЗаписи.Ссылка;
			Если НовМарка.Наименование <> Наименование Тогда
				НовМарка_ = НовМарка.ПолучитьОбъект();
				НовМарка_.Наименование = Наименование;
				Попытка
				    НовМарка_.Записать();
 				Исключение
					//
				КонецПопытки;
 			КонецЕсли;
			Возврат НовМарка;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20240330
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Марка_Авито.Ссылка,
		|	Марка_Авито.Наименование,
		|	Марка_Авито.Артикул
		|ИЗ
		|	Справочник.Марка_Авито КАК Марка_Авито
		|ГДЕ
		|	Марка_Авито.Наименование = &Наименование
		|	И Марка_Авито.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМарка = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовМарка;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМарка) Тогда
		
		НовМарка = Справочники.Марка_Авито.СоздатьЭлемент();
		НовМарка.УстановитьНовыйКод("ЦБ");
		НовМарка.Наименование = Наименование;
		НовМарка.Артикул = Артикул;
		Попытка НовМарка.Записать(); Исключение  КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМарка.Ссылка;

КонецФункции // НайтиИлиСоздатьМарку(Наименование) 

Функция НайтиИлиСоздатьМодель(Наименование,Артикул,Марка) Экспорт
	
	НовМодель = Справочники.Модели_Авито.ПустаяСсылка();
	
	//Бондаренко++ 20240330
	Если СокрЛП(Артикул) <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модель_Авито.Ссылка,
		|	Модель_Авито.Наименование,
		|	Модель_Авито.Артикул
		|ИЗ
		|	Справочник.Модели_Авито КАК Модель_Авито
		|ГДЕ
 		|	Модель_Авито.МаркаАвито = &Марка
		|	И Модель_Авито.Артикул = &Артикул";
		
 		Запрос.УстановитьПараметр("Артикул", Артикул);
		Запрос.УстановитьПараметр("Марка", Марка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовМодель = ВыборкаДетальныеЗаписи.Ссылка;
			Если НовМодель.Наименование <> Наименование Тогда
				НовМодель_ = НовМодель.ПолучитьОбъект();
				НовМодель_.Наименование = Наименование;
				Попытка
					НовМодель_.Записать();
				Исключение
					//
				КонецПопытки;
			КонецЕсли;
			Возврат НовМодель;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20240330
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модель_Авито.Ссылка,
		|	Модель_Авито.Наименование,
		|	Модель_Авито.Артикул
		|ИЗ
		|	Справочник.Модели_Авито КАК Модель_Авито
		|ГДЕ
		|	Модель_Авито.Наименование = &Наименование
		|	И Модель_Авито.МаркаАвито = &Марка
		|	И Модель_Авито.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Марка", Марка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодель = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовМодель;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодель) Тогда
		
		НовМодель = Справочники.Модели_Авито.СоздатьЭлемент();
		НовМодель.УстановитьНовыйКод("ЦБ");
		НовМодель.Наименование = Наименование;
		НовМодель.Артикул = Артикул;
		НовМодель.МаркаАвито = Марка; 
		
		Попытка	НовМодель.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМодель.Ссылка;

КонецФункции // НайтиИлиСоздатьМодель(Наименование,Марка)

Функция НайтиИлиСоздатьМодификацию(Наименование,Артикул,Модель,Генерация) Экспорт
	
	НовМодификация = Справочники.Модификации_Авито.ПустаяСсылка();
	
	//Бондаренко++ 20240330
	Если СокрЛП(Артикул) <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модификация_Авито.Ссылка,
		|	Модификация_Авито.Наименование,
		|	Модификация_Авито.Владелец,
		|	Модификация_Авито.Артикул,
		|	Модификация_Авито.ГенерацияАвито
		|ИЗ
		|	Справочник.Модификации_Авито КАК Модификация_Авито
		|ГДЕ
 		|	Модификация_Авито.Владелец = &Модель
		|	И Модификация_Авито.Артикул = &Артикул";
		
 		Запрос.УстановитьПараметр("Артикул", Артикул);
		Запрос.УстановитьПараметр("Модель", Модель);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовМодификация = ВыборкаДетальныеЗаписи.Ссылка;
			Если НовМодификация.Наименование <> Наименование Тогда
				НовМодификация_ = НовМодификация.ПолучитьОбъект();
				НовМодификация_.Наименование = Наименование;
				Попытка
					НовМодификация_.Записать();
				Исключение
					//
				КонецПопытки;
			КонецЕсли;
			Возврат НовМодификация;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20240330
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Модификация_Авито.Ссылка,
		|	Модификация_Авито.Наименование,
		|	Модификация_Авито.Владелец,
		|	Модификация_Авито.Артикул,
		|	Модификация_Авито.ГенерацияАвито
		|ИЗ
		|	Справочник.Модификации_Авито КАК Модификация_Авито
		|ГДЕ
		|	Модификация_Авито.Наименование = &Наименование
		|	И Модификация_Авито.Владелец = &Модель
		|	И Модификация_Авито.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Модель", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовМодификация = ВыборкаДетальныеЗаписи.Ссылка;
		Если обЗначениеНеЗаполнено(ВыборкаДетальныеЗаписи.ГенерацияАвито) Тогда
			СпрОбъект = НовМодификация.ПолучитьОбъект(); 
			СпрОбъект.ГенерацияАвито = Генерация;
			Попытка	СпрОбъект.Записать(); Исключение КонецПопытки;
 		КонецЕсли; 

		Возврат НовМодификация;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовМодификация) Тогда
		
		НовМодификация = Справочники.Модификации_Авито.СоздатьЭлемент();
		НовМодификация.УстановитьНовыйКод("ЦБ");
		НовМодификация.Наименование = Наименование;
		НовМодификация.Артикул = Артикул;
		НовМодификация.Владелец = Модель; 
		НовМодификация.ГенерацияАвито = Генерация;
		
		Попытка	НовМодификация.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовМодификация.Ссылка;

КонецФункции // НайтиИлиСоздатьМодификацию(Наименование,Модель)

Функция НайтиИлиСоздатьГенерацию(Наименование,Артикул,Модель) Экспорт
	
	НовГенерация = Справочники.Генерации_Авито.ПустаяСсылка();
	
	//Бондаренко++ 20240330
	Если СокрЛП(Артикул) <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Генерация_Авито.Ссылка,
		|	Генерация_Авито.Наименование,
		|	Генерация_Авито.Владелец,
		|	Генерация_Авито.Артикул
		|ИЗ
		|	Справочник.Генерации_Авито КАК Генерация_Авито
		|ГДЕ
 		|	Генерация_Авито.Владелец = &Модель
		|	И Генерация_Авито.Артикул = &Артикул";
		
 		Запрос.УстановитьПараметр("Артикул", Артикул);
		Запрос.УстановитьПараметр("Модель", Модель);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовГенерация = ВыборкаДетальныеЗаписи.Ссылка;
			Если НовГенерация.Наименование <> Наименование Тогда
				НовГенерация_ = НовГенерация.ПолучитьОбъект();
				НовГенерация_.Наименование = Наименование;
				Попытка
					НовГенерация_.Записать();
				Исключение
					//
				КонецПопытки;
			КонецЕсли;
			Возврат НовГенерация;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20240330
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Генерация_Авито.Ссылка,
		|	Генерация_Авито.Наименование,
		|	Генерация_Авито.Владелец,
		|	Генерация_Авито.Артикул
		|ИЗ
		|	Справочник.Генерации_Авито КАК Генерация_Авито
		|ГДЕ
		|	Генерация_Авито.Наименование = &Наименование
		|	И Генерация_Авито.Владелец = &Модель
		|	И Генерация_Авито.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Модель", Модель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовГенерация = ВыборкаДетальныеЗаписи.Ссылка;
		Возврат НовГенерация;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовГенерация) Тогда
		
		НовГенерация = Справочники.Генерации_Авито.СоздатьЭлемент();
		НовГенерация.УстановитьНовыйКод("ЦБ");
		НовГенерация.Наименование = Наименование;
 		НовГенерация.Артикул = Артикул;
		НовГенерация.Владелец = Модель; 
		
		Попытка	НовГенерация.Записать(); Исключение КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовГенерация.Ссылка;

КонецФункции // НайтиИлиСоздатьГенерацию(Наименование,Модель)

Функция НайтиИлиСоздатьКомплектацию(Наименование,Артикул,Модификация,Генерация) Экспорт
	
	НовКомплектация = Справочники.Комплектации_Авито.ПустаяСсылка();
	
	//Бондаренко++ 20240330
	Если СокрЛП(Артикул) <> "" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комплектация_Авито.Ссылка,
		|	Комплектация_Авито.Наименование,
		|	Комплектация_Авито.Владелец,
		|	Комплектация_Авито.Артикул,
		|	Комплектация_Авито.ГенерацияАвито
		|ИЗ
		|	Справочник.Комплектации_Авито КАК Комплектация_Авито
		|ГДЕ
 		|	Комплектация_Авито.Владелец = &Модификация
		|	И Комплектация_Авито.Артикул = &Артикул";
		
 		Запрос.УстановитьПараметр("Артикул", Артикул);
		Запрос.УстановитьПараметр("Модификация", Модификация);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НовКомплектация = ВыборкаДетальныеЗаписи.Ссылка;
			Если НовКомплектация.Наименование <> Наименование Тогда
				НовКомплектация_ = НовКомплектация.ПолучитьОбъект();
				НовКомплектация_.Наименование = Наименование;
				Попытка
					НовКомплектация_.Записать();
				Исключение
					//
				КонецПопытки;
			КонецЕсли;
			Возврат НовКомплектация;
		КонецЦикла;
	КонецЕсли;
	//Бондаренко-- 20240330
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Комплектация_Авито.Ссылка,
		|	Комплектация_Авито.Наименование,
		|	Комплектация_Авито.Владелец,
		|	Комплектация_Авито.Артикул,
		|	Комплектация_Авито.ГенерацияАвито
		|ИЗ
		|	Справочник.Комплектации_Авито КАК Комплектация_Авито
		|ГДЕ
		|	Комплектация_Авито.Наименование = &Наименование
		|	И Комплектация_Авито.Владелец = &Модификация
		|	И Комплектация_Авито.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Запрос.УстановитьПараметр("Модификация", Модификация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовКомплектация = ВыборкаДетальныеЗаписи.Ссылка;
		Если обЗначениеНеЗаполнено(ВыборкаДетальныеЗаписи.ГенерацияАвито) Тогда
			СпрОбъект = НовКомплектация.ПолучитьОбъект();
			СпрОбъект.ГенерацияАвито = Генерация;
			Попытка	СпрОбъект.Записать(); Исключение КонецПопытки;
 		КонецЕсли; 
		Возврат НовКомплектация;
	КонецЦикла;
	
	Если обЗначениеНеЗаполнено(НовКомплектация) Тогда
		
		НовКомплектация = Справочники.Комплектации_Авито.СоздатьЭлемент();
		НовКомплектация.УстановитьНовыйКод("ЦБ");
		НовКомплектация.Наименование = Наименование;
		НовКомплектация.Артикул = Артикул;
		НовКомплектация.Владелец = Модификация;
		НовКомплектация.ГенерацияАвито = Генерация;
		
		Попытка	НовКомплектация.Записать(); Исключение	КонецПопытки;
		
	КонецЕсли; 
 
	Возврат НовКомплектация.Ссылка;

КонецФункции // НайтиИлиСоздатьКомплектацию(Наименование,Модификация)

Функция НайтиИлиСоздатьТипКузова(Наименование,Артикул) Экспорт

 	ТипКузоваАвитоКоммерческий = Справочники.СМ_ТипыКузововАвито.СоздатьЭлемент();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СМ_ТипыКузововАвито.Ссылка,
	|	СМ_ТипыКузововАвито.Наименование,
	|	СМ_ТипыКузововАвито.Артикул
	|ИЗ
	|	Справочник.СМ_ТипыКузововАвито КАК СМ_ТипыКузововАвито
	|ГДЕ
	|	СМ_ТипыКузововАвито.Наименование = &Наименование
	|	И НЕ СМ_ТипыКузововАвито.Коммерческий
	|	И СМ_ТипыКузововАвито.Артикул = &Артикул";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Артикул", Артикул);
 	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТипКузоваАвитоКоммерческий = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
 	КонецЦикла;
	
 	Если обЗначениеНеЗаполнено(ТипКузоваАвитоКоммерческий.Ссылка) Тогда
		
		БылиОшибки = Ложь;
 		ТипКузоваАвитоКоммерческий.Наименование = Наименование; 
		ТипКузоваАвитоКоммерческий.Артикул = Артикул; 		
		ТипКузоваАвитоКоммерческий.Коммерческий = Ложь;		
		ТипКузоваАвитоКоммерческий.УстановитьНовыйКод();
 		
		Попытка	
			ТипКузоваАвитоКоммерческий.Записать(); 
 		Исключение    
			БылиОшибки = Истина;
 		КонецПопытки;

		Если Отладка Тогда 	    
			Если НЕ БылиОшибки Тогда 	    
	 			СМГ_Сообщить("Записан новый элемент справочника СМ_ТипыКузововАвито  с наименованием = <"+Наименование+">.",СтатусСообщения.ОченьВажное);
	  		Иначе
	 			СМГ_Сообщить("ОШИБКА! Не удалось записать элемент справочника СМ_ТипыКузововАвито  с наименованием = <"+Наименование+">.",СтатусСообщения.ОченьВажное);
			КонецЕсли;
		КонецЕсли;	
		
	КонецЕсли;
 
	Если Отладка Тогда 	    
 		СМГ_Сообщить("Обнаружен элемент справочника СМ_ТипыКузововАвито = <"+ТипКузоваАвитоКоммерческий+">." );
  	КонецЕсли;
	
	Возврат ТипКузоваАвитоКоммерческий.Ссылка;
	
КонецФункции // НайтиСоздатьТипКузова(Наименование)
